Tekla Open API Reference for Tekla Structures 2025
RebarSplice Properties
The RebarSplice type exposes the following members.
Properties
Name | Description
BarPositions
 Value 0: Joined bars on top of each other in the case of the lap type splice. Value 1: Joined bars parallel to each other in the case of the lap type splice.
Clearance
 The clearance between joined bars in the case of the lap type splice.
Identifier
 The identifier of the object.
 (Inherited from Object.)
IsUpToDate
Gets if the object does not have a modification which is not shared.
 (Inherited from ModelObject.)
LapLength
 The lap length of the lap type splice.
ModificationTime
Gets latest time of the object was modified or created.
 (Inherited from ModelObject.)
Offset
 The distance from the end point of the first bar along the bar length.
RebarGroup1
 The first one of the joined reinforcements (picked first).
RebarGroup2
 The second one of the joined reinforcements (picked second).
Type
 The type of the splice (can be a lap, weld or muff splice).
Top
See Also
Reference
RebarSplice Class
Tekla.Structures.Model Namespace